;abilities
[RM_Punch X2AbilityTemplate]
LocFriendlyName="Punch"
LocLongDescription="Attack any enemy next to you with a semi-powerful melee attack."
LocHelpText="Attack any enemy next to you with a semi-powerful melee attack."
LocPromotionPopupText="<Bullet/>Unlike Strike, Punch can only attack targets next to you, and is weaker than a normal strike.<br/><Bullet/> However, Punch only costs 1 action point: melee enemies that attack you are left open to multiple attacks.<br/>"


[RMGrimyCloseCombat X2AbilityTemplate]
LocFriendlyName="Close Combat Protocol"
LocLongDescription="Free reaction fire shot against all enemies that approach within <Ability:CLOSE_COMBAT_DISTANCE/> tiles."
LocHelpText="Free reaction fire shot against all enemies that approach within <Ability:CLOSE_COMBAT_DISTANCE/> tiles."
LocPromotionPopupText="<Bullet/>Free reaction fire shot against all enemies that approach within <Ability:CLOSE_COMBAT_DISTANCE/> tiles.<br/>"

[RMGrimyMayhem X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocLongDescription="Suppression deals <Ability:MAYHEM_DMG/> damage."
LocHelpText="Suppression deals <Ability:MAYHEM_DMG/> damage."
LocPromotionPopupText="<Bullet/> Suppression deals <Ability:MAYHEM_DMG/> damage.<br/>"

[UtilityRigging X2AbilityTemplate]
LocFriendlyName="Nanomuscle Fibres"
LocLongDescription="SPARKs gain +<Ability:MUSCLE_MOBILITY/> mobility"
LocHelpText="SPARKs gain <Ability:MUSCLE_MOBILITY/> mobility"
LocPromotionPopupText="<Bullet/> SPARKs gain <Ability:MUSCLE_MOBILITY/> mobility<br/>"

[PCSAdaptation X2AbilityTemplate]
LocFriendlyName="Chip Adaptation"
LocLongDescription="SPARKs gain +<Ability:AIM_POINTS> aim."
LocHelpText="SPARKs gain +<Ability:AIM_POINTS> aim."
LocPromotionPopupText="<Bullet/> SPARKs gain +<Ability:AIM_POINTS> aim.<br/>"

[SPARKShields X2AbilityTemplate]
LocFriendlyName="SPARK Shields"
LocLongDescription="SPARKs gain <Ability:SPARK_SHIELD/> points of shields on missions."
LocHelpText="SPARKs gain <Ability:SPARK_SHIELD/> points of shields on missions."
LocPromotionPopupText="<Bullet/> SPARKs gain <Ability:SPARK_SHIELD/> points of shields on missions.<br/>"

[HeavyWeaponStorage X2AbilityTemplate]
LocFriendlyName="Heavy Weapon Storage"
LocLongDescription="SPARKs gain +<Ability:HEAVY_STORAGE/> charges for heavy weapons."
LocHelpText="SPARKs gain +<Ability:HEAVY_STORAGE/> charges for heavy weapons."
LocPromotionPopupText="<Bullet/> SPARKs gain +<Ability:HEAVY_STORAGE/> charges for heavy weapons.<br/>"

[AutomatedThreatAssessment X2AbilityTemplate]
LocFriendlyName="Automated Threat Assessment"
LocLongDescription="SPARKs gain <Ability:AUTOMATED_THREAT/> defense if they didn't attack on their turn."
LocHelpText="SPARKs gain <Ability:AUTOMATED_THREAT/> defense if they didn't attack on their turn."
LocPromotionPopupText="<Bullet/> SPARKs gain <Ability:AUTOMATED_THREAT/> defense if they didn't attack on their turn.<br/>"

[BerserkerGauntlet X2AbilityTemplate]
LocFriendlyName="Berserker Gauntlet"
LocLongDescription="SPARKs gain +<Ability:GAUNTLET_DMG/> damage with the Strike ability."
LocHelpText="SPARKs gain +<Ability:GAUNTLET_DMG/> damage with the Strike ability."
LocPromotionPopupText="<Bullet/> SPARKs gain +<Ability:GAUNTLET_DMG/> damage with the Strike ability.<br/>"

[NanomachinesSon X2AbilityTemplate]
LocFriendlyName="Self-repairing Nanomachines"
LocLongDescription="SPARKs gain reduced repair times, and for damage incurred at or below -<Ability:NANOREPAIR/>, don't need repairs at all."
LocHelpText="SPARKs gain reduced repair times, and for damage incurred at or below -<Ability:NANOREPAIR/>, don't need repairs at all."
LocPromotionPopupText="<Bullet/> SPARKs gain reduced repair times, and for damage incurred at or below -<Ability:NANOREPAIR/>, don't need repairs at all.<br/>"

[HyperReactiveRounds X2AbilityTemplate]
LocFriendlyName="Self-Correcting Rounds"
LocLongDescription="Units gain +<Ability:SELF_AIM/> aim for their next shot if they missed the last one."
LocHelpText="Units gain +<Ability:SELF_AIM/> aim for their next shot if they missed the last one."
LocPromotionPopupText="<Bullet/> Units gain +<Ability:SELF_AIM/> aim for their next shot if they missed the last one.<br/>"

[ShieldHardener X2AbilityTemplate]
LocFriendlyName="Shield Hardener"
LocLongDescription="The unit's shields will block all overflow damage on attacks that bring it down."
LocHelpText="The unit's shields will block all overflow damage on attacks that bring it down."
LocPromotionPopupText="<Bullet/> The unit's shields will block all overflow damage on attacks that bring it down.<br/>"

[NanoweaveBonus X2AbilityTemplate]
LocFriendlyName="Nanoweave Plate"
LocLongDescription="A unit will gain +<Ability:NANOWEAVE/> armour after taking damage."
LocHelpText="A unit will gain +<Ability:NANOWEAVE/> armour after taking damage."
LocPromotionPopupText="<Bullet/> A unit will gain +<Ability:NANOWEAVE/> armour after taking damage.<br/>"

[NanoweavePassive X2AbilityTemplate]
LocFriendlyName="Nanoweave Plate"
LocLongDescription="A unit will gain +<Ability:NANOWEAVE/> armour after taking damage."
LocHelpText="A unit will gain +<Ability:NANOWEAVE/> armour after taking damage."
LocPromotionPopupText="<Bullet/> A unit will gain +<Ability:NANOWEAVE/> armour after taking damage.<br/>"

[CodexModuleBonus X2AbilityTemplate]
LocFriendlyName="Codex Module"
LocLongDescription="A unit will gain +<Ability:CODEX_DODGE/> dodge for every enemy in sight, up to +<Ability:CODEX_MAX/>."
LocHelpText="A unit will gain +<Ability:CODEX_DODGE/> dodge for every enemy in sight, up to +<Ability:CODEX_MAX/>."
LocPromotionPopupText="<Bullet/>A unit will gain +<Ability:CODEX_DODGE/> dodge for every enemy in sight, up to +<Ability:CODEX_MAX/>.<br/>"

[RM_Suppression X2AbilityTemplate]
LocFriendlyName="Suppression"
LocLongDescription="Fire a barrage that pins down a target, granting reaction fire against it if it moves, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to the target's aim."
LocHelpText="Penalize target's aim and shoot them if they move."
LocFlyOverText="Suppression"
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/>"


[SuppressionProtocol X2AbilityTemplate]
LocFriendlyName="Suppression Protocol"
LocLongDescription="SPARKs can suppress."
LocHelpText="SPARKs can suppress."
LocPromotionPopupText="<Bullet/> SPARKs can suppress.<br/>"

;techs


[SPARKSuppression X2TechTemplate]
DisplayName="SPARK Suppression"
Summary="Now that we have Dad's final project manufacturable, I can get to work on upgrading their programming to 2035 standards, it should let them be able to suppress enemy contacts in the field."

[SPARKPCS X2TechTemplate]
DisplayName="ADVENT Chip Adaptation"
Summary="With Tygan's detailed report on how ADVENT's chip system works and access to some Officer corpses, I can convert the chips in them to assist our SPARKs in aiming against enemy targets in the field."

[SPARKRigging X2TechTemplate]
DisplayName="Nanomuscle Fibres"
Summary="The armour of Mutons seem to be made out of this nanomuscle fibre that actually hold up pretty well against immense loads. If we get more of it, I might be able to upgrade how fast our SPARKs can move, and let them carry modified ammunition."

[SPARKShields X2TechTemplate]
DisplayName="SPARK Shields"
Summary="While we've been having issues duplicating the ADVENT Shieldbearer's shield generators at a manportable size or their squad-affecting range, we can make a SPARK-portable one that'll work to protect them from initial fire."

[SPARKMayhem X2TechTemplate]
DisplayName="Mayhem Protocol"
Summary="I did some digging into the body of the ADVENT MEC we recovered, and I think we can use ADVENT's engineering against them to boost our SPARKs' suppressive fire capabilities."

[SPARKCloseCombat X2TechTemplate]
DisplayName="Close Combat Protocol"
Summary="This Andromedon's suit is a nasty piece of work by the aliens, but the damaged AI we've recovered from the suit has given me some ideas. If the tactical teams can give me some more suits, I might be able to make our SPARKs more reactive to threats."

[SPARKHeavyWeapon X2TechTemplate]
DisplayName="SPARK Heavy Weapon Storage"
Summary="The Sectopod was one of the toughest alien machines deployed during the initial invasion. Now that we've managed to get a close up look at it, it's pretty ingenious as to how much firepower they managed to pack into it. I might be able to replicate similar storage capacity for SPARK heavy weapons if we get another set of Sectopod remains."

[SPARKATA X2TechTemplate]
DisplayName="Automated Threat Assessment"
Summary="Tygan handed over the mechanical shell of the Gatekeeper to me, and while most of it's psionically controlled, a lot of its defense orientation is actually controlled by a surprisingly smart virtual intelligence. If we can get another corpse like this, I may be able to make a XCOM-equivalent for our SPARKs."

[SPARKGauntlet X2TechTemplate]
DisplayName="Berserker-based Gaunlets"
Summary="The musculature of Berserkers has given me ideas for improvements on the Strike capabilties of SPARKs. If we get another corpse, I could have Tygan make a more detailed analysis of it and use that to make mechanical equivalents for SPARKs."

[SPARKNanomachines X2TechTemplate]
DisplayName="Self-repairing Nanomachines"
Summary="The biomechatronics of the Archon include nanomachines that start dumping mass amounts of adrenaline and skin-hardening chemicals when the user is injured. If properly modified and re-programmed, we could use these nanomachines to help reduce SPARK repair times whenever they're damaged."


[RebuildSPARK X2TechTemplate]
DisplayName="Rebuild SPARK"
Summary="SPARKs have an advantage over us humans: they don't lose everything when they experience catastrophic damage. We can repair the chassis, and even upload the original, backed up programming to it at a fraction of the cost of making a brand new SPARK. Note that there's a limitation on how fast the AI can completely reboot to its previous state: it'll need to go on missions to remember everything."

[RM_ConvertMEC X2TechTemplate]
DisplayName="Salvage Wrecked MECs"
Summary="Designed by the late Dr. Raymond Shen before the initial invasion some 20 years ago, the captured SPARK robotic prototype apparently served as the progenitor for all future ADVENT MEC designs. We can use that against ADVENT: with enough salvage from wrecked MECs, we can make a SPARK out of the remains with some additional supplies."

;items and corpse

[CorpseSPARK X2ItemTemplate]
FriendlyName="Damaged SPARK Chassis"
FriendlyNamePlural="Damaged SPARK Chassis"
BriefSummary="The wreck of a XCOM SPARK that has fallen in combat. Maybe Engineering can do something with this..." 

[SCRounds X2AmmoTemplate]
FriendlyName="Self-Correcting Rounds"
FriendlyNamePlural="Self-Correcting Rounds"
BriefSummary="These rounds are derived from the implants we found in the ADVENT Officers and the later adaptations we made to SPARKs, they have the ability to assist a weapon's targeting on a user's initial miss of a target."
TacticalText="<Bullet/> These rounds confers +<Ability:SELF_AIM/> aim for your next shot with your primary weapon after a shot misses."

[Hardener X2EquipmentTemplate]
FriendlyName="Shield Hardener"
FriendlyNamePlural="Shield Hardeners"
BriefSummary="The Shield Hardener is derived from our SPARK-based shield tech, while it barely provides any protection on its own, it does make any shield its attached to protect against even massive hits, even if it will take down the shield. "
TacticalText="<Bullet/> The unit's shields will block all damage against hits that take them down. Provides 1 shield hit point."

[Nanoweave X2EquipmentTemplate]
FriendlyName="Nanoweave Plate"
FriendlyNamePlural="Nanoweave Plates"
BriefSummary="Nanoweave Plate is an impact-hardening armour insert for our units, on their own they don't do anything, but once a unit has taken a hit, the plates will harden and provide additional protection."
TacticalText="<Bullet/> Provides +<Ability:NANOWEAVE/> armour once a unit has taken a hit. This effect normally lasts for 2 turns, but can be extended if the unit keeps taking a hit every turn."

[CodexModule X2EquipmentTemplate]
FriendlyName="Codex Module"
FriendlyNamePlural="Codex Modules"
BriefSummary="Codex Modules are derived from the brains of Codexes defeated in the field, they provide units with the ability to more easily dodge enemy fire, and are able to do more calculation the more enemies the unit is in range of."
TacticalText="<Bullet/> Provides +<Ability:CODEX_DODGE/> dodge for every enemy in range of the unit, up to +<Ability:CODEX_MAX/>."
